{
  "scraped_at": "2025-08-24T18:44:58.307Z",
  "summary": {
    "total": 1,
    "success": 1,
    "failed": 0
  },
  "results": [
    {
      "country": "Slovenia",
      "url": "https://www.papayaglobal.com/countrypedia/country/slovenia/",
      "scraped_at": "2025-08-24T18:44:58.299Z",
      "data": {
        "contribution": {
          "employer_contributions": [],
          "employee_contributions": [],
          "income_tax": []
        },
        "minimum_wage": "The minimum wage is 1,277.72 EUR per month.",
        "payroll": {
          "payroll_cycle": "In Slovenia, the payroll frequency is monthly with the payment of salaries usually made on the last working day of each month.",
          "13th_salary": "In Slovenia, there is no 13th salary, however, a mandatory Holiday allowance must be paid by 30th June at the minimum and maximum tax free amount set each year up (for 2024 the minimum is 1,253.90 Euros and the maximum is 2,317.82 Euros)."
        },
        "working_hours": {
          "general": "The standard working week consists of 40 hours over a five-day working week, including a 30-minute lunch break. To be considered a full-time employee in Slovenia, an employee must work at least 36 hours a week except for employees who work in a particularly dangerous environment who may work fewer than 36 hours.",
          "overtime": "All work more than the standard working hours a week is to be paid as overtime and is regulated by the employment contract/collective agreement. When an employee is requested to work overtime or work on holidays, there are maximums in relation to the number of hours allowed. These maximums are 8 hours per week, 20 hours per month, or 170 hours per year. Maximums may differ for minors, pregnant women, and minors.\nAll overtime hours in excess of 40 hours a week are paid at an overtime compensation rate; this rate is to be stipulated in the employment contract/collective agreement, though is usually around 150% salary.\nAn employer must provide written notice of any upcoming overtime."
        },
        "leave": {
          "annual_leave_(vacation)": "Employees are entitled to paid annual leave of at least four weeks (20 working days) in every calendar year regardless of whether they work full-time or part-time. An employee is entitled to this payment after six months of continuous employment, prorated accordingly.\nThe employer must let the employee take the annual leave entitlement by the end of the current calendar year. The employee must use at least two weeks of annual leave before the end of the current calendar year; the remaining part can be used in agreement with the employer up until 30 June of the following year.\nLocal labor law defines cases of personal circumstances on the basis of which based on the law itself, the worker is entitled to additional days of annual leave:\nLength of Service Leave\n3-5 years of service: 1 day additional leave\n6-10 years of service: 2 days additional leave\n11-15 years of service: 4 days additional leave\n16-20 years of service: 5 days additional leave\n21-25 years of service: 6 days additional leave\nWorkers with a child up to 15 years of age (1 additional day per child).\nA worker who has not yet reached the age of 18 has the right to an additional seven days of annual leave.\nDisabled workers with at least 60% physical disability, and workers who care for and protects a child in need of special care and protection, are also entitled for additional leave.\nIn addition to paid annual leave, the mandatory Holiday allowance must be paid by 30th June each year. A minimum and maximum tax free amount is set each year up (for 2024 the minimum is 1,253.90 Euros and the maximum is 2,317.82 Euros).  Employers must pay at least the minimum monthly wage for the year, unless the employee was hired during the year, in which case they receive a proportional payment.",
          "public_holidays": "Public holidays that fall on the weekend are usually lost.\nDate\tDay\tHoliday\tNotes\n1 Jan 2025\tWednesday\tNew Year’s Day\t\n2 Jan 2025\tThursday\tNew Year’s Day\t\n8 Feb 2025\tSaturday\tPrešeren’s Day\t\n21 Apr 2025\tMonday\tEaster Monday\t\n27 Apr 2025\tSunday\tResistance Day\t\n1 May 2025\tThursday\tLabour Day\t\n2 May 2025\tFriday\tLabour Day Holiday\t\n25 Jun 2025\tWednesday\tNational Day\t\n15 Aug 2025\tFriday\tAssumption Day\t\n31 Oct 2025\tFriday\tReformation Day\t\n1 Nov 2025\tSaturday\tAll Saints’ Day\t\n25 Dec 2025\tThursday\tChristmas Day\t\n26 Dec 2025\tFriday\tIndependence and Unity Day",
          "sick_days": "Slovenia requires employers to compensate an employee for sick leave for up to 30 days of absence; the amount is stipulated within the employment contract/collective agreement. If an employee is absent due to a work-related illness or accident, the employer should compensate them at 100% of their regular salary. 80% salary is usually paid out for a regular sick leave.\nSick leave in excess of 30 days is to be compensated by Social Security until they are deemed fit to return to work or their employment is terminated.\nAn employee must provide a medical certificate as soon as possible following sickness.",
          "maternity_leave": "Mothers in Slovenia receive 105 days of paid maternity leave which begins 28 days before the estimated date of birth. An employee must take a minimum of 15 days maternity leave. To be eligible for paid maternity leave, an employee must have made a year’s worth of insurance payments to the Parent Protection Insurance over the three years preceding the pregnancy.\nSocial Security will compensate the employee based on the amount contributed to the Parent Protection insurance; the benefit will be between 55% of a minimum base salary and twice the average monthly salary in Slovenia.",
          "paternity_leave": "Fathers are entitled to 30 days of paternity leave, with the paternity benefit equaling 100% of the base amount. However, this benefit cannot exceed 2.5 times the average monthly wage.",
          "parental_leave": "Slovenia grants each parent 130 days of parental leave to care for a child. This entitlement can increase in the case of multiple/complicated births.\nEither the father or the mother can transfer 100 days of their leave to the other to care for their child, making a total of 260 days that can be taken.",
          "other_leave": "In Slovenia, employees are entitled to up to seven days of paid personal leave. This leave is to be used for weddings, births, and bereavement."
        },
        "termination": {
          "termination_process": "The termination process varies according to the employment agreement or collective agreement in place and is based on the type of contract and reason for termination. There are two types of dismissals:\nRegular dismissal is issued for a business reason (redundancy), worker incompetence, an at-fault reason (misconduct), unfitness to work due to disability, or failed probation period.\nExtraordinary dismissal is issued for severe scenarios such as criminal offense, declining a transfer and similar breaches.\nAll dismissals must be presented to the employer in writing, and the employee must be given the opportunity to present a defense. In extraordinary dismissals, the termination must be presented in writing and in person.",
          "notice_period": "The length of the notice period depends on the type of dismissal:\nDismissal for business reasons has notice periods dependent on the employee’s length of service:\n-Up to 1 year service = 15 days’ notice\n-1 to 2 years service = 30 days’ notice\n-Above 2 years service = 30 days plus and additional 2 days notice for every additional year of service above two years, up to a maximum of 60 days notice.\nDismissal for at fault reasons = 15 days notice.\nDismissal for failed probation period = 7 days notice.\nExtraordinary dismissal = no notice required. However, the employer must still provide termination of the notice within 30 days of the incident that led to the termination.",
          "severance_pay": "For dismissal due to business reasons or employee incompetence, employees are entitled to severance pay based on the employee’s service length:\n1-10 years of service receive 1/5 of the employee’s average salary from the previous three months for every year of service.\n10-20 years of service receive 1/4 of the average salary from the past three months for every year of service.\nOver 20 years of service receive 1/3 of the average salary from the past three months for every year of service. However, there is a maximum severance payment limit of ten times the employee’s basic monthly salary.\nSeverance might also be required in certain cases of termination of Fixed Term contracts, receiving 1/5 of the average monthly salary for the first year of service. An additional amount (which amounts to one-twelfth of the one-fifth of salary calculated for the first year) will then also be added for each extra month of employment above the first year of employment.",
          "probation_period": "In Slovenia, probation periods are outlined in the employee’s employment contract. The probation period can be no more than six months."
        },
        "visa": {
          "general_info": "Work and residence permits are regulated under the Employment, Self-employment, and Work of Foreigners Act, enacted in 2015. The permits are obligatory for all non-EU nationals who wish to be employed in Slovenia. Unless they can be considered for the following exception:\n\nRefugees\nImmediate family members of Slovenian citizens\nNon-EU nationals with a permit for permanent residence\nNon-EU nationals who have obtained the status of a long-term resident in another member state of the EU after residing in the Republic of Slovenia for one year\nNon-EU nationals of Slovenian origin up to the third successive generation\n\nTo obtain a long-term work permit, an individual should apply for a single residence permit for work and residence in Slovenia (The Single Permit).\nSingle permits are issued by the administrative unit (“Upravna enota”) with the consent of the Employment Service of Slovenia (“ESS”) on the basis of the Employment, Self-employment, and Work of Foreigners Act and corresponding regulation.\nAfter applying for The Single Permit, the administrative unit will automatically begin the process of obtaining consent from the Employment Service of Slovenia. An application for The Single Permit may be submitted by a foreigner or by the employer."
        },
        "vat": {
          "general": "The standard VAT rate is 22%."
        }
      }
    }
  ]
}