{
  "scraped_at": "2025-08-24T18:26:22.781Z",
  "summary": {
    "total": 1,
    "success": 1,
    "failed": 0
  },
  "results": [
    {
      "country": "Netherlands",
      "url": "https://www.papayaglobal.com/countrypedia/country/netherlands/",
      "scraped_at": "2025-08-24T18:26:22.767Z",
      "data": {
        "contribution": {
          "employer_contributions": [
            {
              "rate": "5.46% – 7.64%",
              "description": "WAO/WIA Aof: Invalidity Insurance Fund 5.49% (small employers) to 7.11% (medium to large employers), applied on income up to 75,864 EUR annually."
            },
            {
              "rate": "2.74% – 7.74%",
              "description": "Unemployment Fund (lower: indefinite contracts, High: temporary contracts/on-call employees), applied on income up to 75,864 EUR annually."
            },
            {
              "rate": "6.57%",
              "description": "ZVW : Healthcare Insurance Act,  applied on income up to 75,864 EUR annually."
            },
            {
              "rate": "0.11 % – 3.36%",
              "description": "WHK: Work Resumption Fund and Sickness Benefits Act applied on income up to 75,864 EUR annually. Applied percentage varies by sector, company size and sector."
            },
            {
              "rate": "0.50%",
              "description": "Child Care Premium, applied on income up to 75,864 EUR annually."
            },
            {
              "rate": "Variable",
              "description": "Pension (mandatory under certain setups only, such as EoR circa 16%)"
            },
            {
              "rate": "8.00%",
              "description": "Holiday allowance accrued on a monthly basis and paid to employees in May."
            },
            {
              "rate": "23.38% to 33.81%",
              "description": "Total Employment Cost"
            }
          ],
          "employee_contributions": [
            {
              "rate": "35.82",
              "description": "Up to 38,441 EUR annually"
            },
            {
              "rate": "37.48%",
              "description": "38,441 EUR- 76,817 EUR annually"
            },
            {
              "rate": "49.50%",
              "description": "Over 76,817 EUR annually"
            }
          ],
          "income_tax": []
        },
        "minimum_wage": "In the Netherlands, the minimum wage (wettelijk brutominimumloon) for employees 21 years and over has been increased to €14.40. For a full-time (40 hours per week) employee paid with a fixed monthly salary, the gross minimum monthly salary is €2,469. In addition, youth minimum wages have been adjusted proportionally for employees aged 15 to 20. For example:",
        "payroll": {
          "payroll_cycle": "In the Netherlands, the payroll frequency is monthly. Work between the first and last day of the month is typically paid on the last day of the month.",
          "13th_salary": "13th-month salary payments are customary in the Netherlands and should be paid in November or December of each year; this is stipulated in the employee’s employment contract or collective agreements."
        },
        "working_hours": {
          "general": "The standard working week in the Netherlands may be no longer than 45 hours. This is commonly 40 hours per week of 8 hours per day over 5 days.",
          "overtime": "If work time limits are passed, overtime compensation is compulsory. The maximum number of overtime hours is per the employee’s collective agreement/employment contract."
        },
        "leave": {
          "annual_leave_(vacation)": "A full-time employee is entitled to 20 working days of paid annual leave per year. However, in the Netherlands, it is common practice to offer 25 or even 32 days of paid annual leave.\nAlso, any leave accrued from the previous year must be used by July, and the employer must inform the employee if this is about to expire (although this requirement is only for the statutory minimum number of days).",
          "public_holidays": "Public holidays falling on weekends are lost. Public holidays are not necessarily a paid leave day, as this depends on the employer’s policy or collective labor agreement (CLA).\nDate\tDay\tHoliday\tNotes\n1 Jan 2025\tWednesday\tNew Year’s Day\t\n18 Apr 2025\tFriday\tGood Friday\tApplicable depending on company policy/per CBA\n21 Apr 2025\tMonday\tEaster Monday\t\n26 Apr 2025\tSaturday\tKing’s Day Holiday\t\n27 Apr 2025\tSunday\tKing’s Day\t\n5 May 2025\tMonday\tLiberation Day\tApplicable depending CBA\n29 May 2025\tThursday\tAscension Day\t\n9 Jun 2025\tMonday\tWhit Monday\t\n25 Dec 2025\tThursday\tChristmas Day\t\n26 Dec 2025\tFriday\t2nd Day of Christmas",
          "sick_days": "If an employee is unfit to work due to illness,  the employer is obliged to pay at least 70% of their last earned wages plus holiday allowance up to a maximum of two years. Which concrete percentage applies depends on the content of the employment contract and/or CLA provisions. It is possible to pay a higher percentage of wage (normal in the Netherlands is first year 100%).\nThe employer must pay 70% of the employee’s regular wages during the first year of illness (capped at 70% of the Dutch maximum premium wage) If this is less than the minimum wage, then a supplement is required up to the minimum wage amount, 1,995 Euros per month ( July 2023)\nDuring the second year of illness the employer must pay 70% of the employee’s regular wages. There is no need to supplement if the amount is less than the minimum wage.\nIt is common practice (and, as such, is set out in most CLAs) to pay 100 % of the full salary during the first year of illness and 70 % of the full salary during the second year.\nAs per the Working Conditions Act in the Netherlands, it is mandatory for every employer to establish a contract with either a health and safety service or a company doctor. This is referred to as the basic contract. It is the employer’s responsibility to ensure a safe and healthy workplace for their employees. In cases where an employee is suffering from a long-term illness, the company doctor is responsible for evaluating the situation.",
          "maternity_leave": "A pregnant employee is entitled to 16 weeks of paid maternity leave; maternity leave consists of two periods: prenatal leave and postnatal leave.\nPrenatal leave: An employee must take 4-6 weeks leave before the expected due date (zwangerschapsverlof).\nPostnatal leave: A employee must take the remaining 10-12 weeks (bevallingsverlof) which starts from the date of the birth of the child.\nMaternity pay is 100% of the workers daily wage based on the previous years average earnings, capped at 256.54 Euros per day. Employers will make the payment but can reclaim a portion of it from The Employee Insurance Agency (Uitvoeringsinstituut Werknemersverzekeringen, UWV).\nIn the event that pregnancy or childbirth results in incapacity for work, the employee is eligible for benefits equivalent to 100% of her salary for the maximum of a year after the date of birth.",
          "paternity/partner_leave": "Partners are entitled to 1 week of ‘birth leave’, which must be taken within the first 4 weeks following the birth. This leave entitlement applies to both full time and part time workers and can be used in one block or spread over the 4 weeks.\nFull pay must be given by the employer during ‘birth leave’.\nPartners have the right to Extended Partner Leave of up to 5 weeks (25 days), to be taken within the 6 months following the birth. Leave can be taken in one block or spread over 6 months.\nExtended Partner Leave is unpaid but workers might be eligible to claim up to 70% of pay from The Employment Insurance Agency (UWV).",
          "parental_leave": "Parents are entitled to take time off for childcare for a maximum period of 26 x the length of their working week. The first 9 weeks must be used within the first year of the child’s life and are paid by The Employment Insurance Agency (UWV), up to 70% of their daily wage capped at 256.54 Euros per day.\nThe  remaining 17 weeks are unpaid (unless stated otherwise in a Collective Labour Agreement or Employment Contract) and can be used until the child reaches the age of 8.\nAdoption Leave\nParents who adopt or foster a child are entitled to up to 6 weeks leave; this leave can be taken in one block or spread out over the first 26 weeks since the child was brought home. Workers can apply for an adoption allowance during this period from The Employment Insurance Agency (UWV). At least 3 weeks notice must be given before taking this leave.",
          "other_leave": "The following additional leaves are in place (unless a specific Collective Agreement outlines additional entitlements):\nEmergency Leave or Short Absenteeism with pay is available for as long as is reasonably necessary to take care of unexpected urgent personal reasons which require immediate time off e.g. when making arrangements for the care of a sick family member or in the event of a death in the family. The worker must report this leave as soon as possible and indicate how long they expect to be off; the company must always grant a reasonable request for emergency leave. Once the worker returns the company may request (but is not obligated) for proof the leave was necessary. \nShort-term Care Leave is available at up to twice the weekly working time (maximum of 2 weeks) to take care of a sick parent, child or partner if there is no one else but the worker able to provide this care. During this leave the employer continues to pay up to 70% salary.\nLong-term Care Leave is available at up to six times the weekly working time (maximum of 6 weeks) to take care of a seriously ill parent, child or partner. This leave is unpaid.\nUnpaid Leave can be requested on a full or part time basis by the worker to be agreed by the company, though the company is not under any obligation to agree to it. The employment contract will continue during the leave period, though vacation days will not be accrued during the unpaid leave. Long term unpaid leave may impact the pension scheme and unemployment benefits of a worker and this should be taken into account during a the consultation for unpaid leave."
        },
        "termination": {
          "termination_process": "The termination process varies according to the Employment Agreement and Collective Agreement in place and on the type of contract and reason for termination. Depending on the business reasons, it is very common to end employment via a mutual termination agreement (MTA) due to the high risk of termination and the requirement to provide extensive evidence and documentation as well as a full case assessment. Workers will continue to receive renumeration during this period. For these reasons, it is often more economical for the employer to offer an MTA based on negotiated terms. The average settlement is 3-6 months pay, plus notice pay and workers legal fees.\nNo termination due to economic reasons or long-term disability may take place without the Employee Insurance Agency (UWV). An application can be lodged with the UWV called the Form A 24 hours prior to any discussion with a worker, by doing so the employee is no longer protected from termination and MTA discussion can commence. There is a 2 week period to reach an agreement, a further 2 week extension is possible; if no agreement is reached the employer must be in a position to proceed to the next stage with the UWV application to terminate on economic grounds. The necessary documents must be ready and the process will continue.  The outcome can be the employer is granted a permit to terminate or is rejected from doing so.",
          "notice_period": "The statutory minimum notice period for termination in the Netherlands is one month, however, it is dependent on the employee’s length of service as below:\nLess than 5 years – 1 month notice\nBetween 5-10 years – 2 months’ notice\nBetween 10-15 years – 3 month’ notice\nMore than 15 years – 4 months’ notice",
          "severance_pay": "Severance pay regulations are arranged by law, under what’s known as ‘transition payment’.\nThe statutory transition payment is due when the employment agreement has been terminated, and the amount is based on years of service: 1/3 of 1 month’s salary (including holiday allowance and, if any, fixed end-of-year bonus and/or average bonus of the last 3 years and/or commission of the last 12 months) for each calendar year that the employment agreement has lasted, and a pro rata amount for a period where the employment agreement has lasted less or longer than a calendar year.\nThe maximum transition-payment amount is EUR 98,000 gross, or, where an employee earns over EUR 98,000 per annum a maximum of one year’s salary.",
          "probation_period": "Probation or trial periods are generally set within the collective agreements and contracts of the employee; however, the standard practice is:\nIndefinite contracts can have a maximum of 2 months probation\nTemporary contracts under 6 months may not include a a probation period\nTemporary contracts of 6 months to 2 years can have a maximum of 1 month probation\nDuring the probation period, there is no notice period"
        },
        "visa": {
          "general_info": "There is no formal requirement for EU/EEA/Swiss nationals to obtain a residence or work permit. Still, they do need to obtain a residence permit to be eligible for social security benefits.\n\nNationals of the USA, Canada, Japan, Australia, New Zealand, and all non-EU/EEA/Swiss foreign nationals who wish to stay longer than three months in the Netherlands must obtain an “authorization temporary stay” (MVV) from the Dutch embassy or consulate in their home country before entering the Netherlands.\n\nThe employer must submit a work permit application to the Social Security Office (UWV), providing evidence that they have made every effort to recruit a Dutch/EU/EEA/Swiss national in the first instance. No applicant is allowed to work in the Netherlands until their work permit has been approved."
        },
        "remote_work": "While it is not a legal right, employees may request to work (partly) from home under the Flexible Working Act, particularly if they have concerns regarding their health. As an employer, you must have valid reasons for rejecting such a request, such as scheduling conflicts or the inability to perform work duties elsewhere. Additionally, specific conditions must be met for employees to work from home, including having at least 10 employees, being employed for a minimum of six months, and submitting a written request at least two months before the intended start date.\nTo ensure safe and proper working conditions, health and safety regulations apply, and you should provide information and a suitable workspace for employees. Work from home compensation is not required by law, but the employer can give employees who work from home an untaxed allowance of up to EUR 2.15 per day as of 2023 — even if employees work at home for part of the day. However, there is an important exception to this. Employers may only provide one of the two allowances: either the tax-free work-from-home allowance, or the mileage allowance of EUR 0.23 per kilometer. The employee cannot have both allowances at the same time.",
        "vat": {
          "general": "The standard rate of VAT in the Netherlands is 21.00%."
        },
        "authority_payments": [
          {
            "authority_payment": "Belastingdienst Apeldoorn",
            "paid_to": "",
            "due_date": "End of the following month",
            "method": "Wire Transfer"
          },
          {
            "authority_payment": "Hafkamp gerechtsdeurwaarders",
            "paid_to": "Employer Contribution and Income tax",
            "due_date": "No recurring payment, therefore there isn’t any due date",
            "method": "eCheck (Local)"
          }
        ]
      }
    }
  ]
}