{
  "scraped_at": "2025-08-24T18:14:57.016Z",
  "summary": {
    "total": 1,
    "success": 1,
    "failed": 0
  },
  "results": [
    {
      "country": "Ireland",
      "url": "https://www.papayaglobal.com/countrypedia/country/ireland/",
      "scraped_at": "2025-08-24T18:14:57.007Z",
      "data": {
        "contribution": {
          "employer_contributions": [],
          "employee_contributions": [],
          "income_tax": []
        },
        "minimum_wage": "Since 1 January 2025, the national minimum wage in Ireland is set at:",
        "payroll": {
          "payroll_cycle": "Salaries are paid either on a weekly or monthly basis. Employers should pay employees by the last day of the month.",
          "13th_salary": "There are no provisions in the law regarding 13th salaries."
        },
        "working_hours": {
          "general": "A full-time work week is typically 39-40 hours. Employers are responsible for ensuring that employees are given adequate rest.\nA work week cannot exceed 48 hours on average over four months. In addition, employees should get 24 consecutive hours of rest in any period of 7 days, and this should normally follow on from one of the 11-hour rest periods already mentioned. As an alternative, the employer can provide two 24-hour rest periods in a week if it follows a week in which you did not get any 24-hour rest periods. Unless the contract states otherwise, the 24-hour rest period should include a Sunday.",
          "overtime": "Employers have no statutory obligation to pay overtime. Overtime pay is regulated by employment contract/collective agreements.\nMany employers pay employees higher rates of pay for overtime as stipulated within the employment contract. Specific sectors of employment have higher rates of pay for overtime than for regular hours. This is covered by employment regulation orders and registered employment agreements."
        },
        "leave": {
          "annual_leave_(vacation)": "An employee’s entitlement to annual leave or holidays from work is set out both in legislation and the employee’s employment contract.\nThe Organization of Working Time Act 1997 provides a basic annual paid leave entitlement of 4 weeks (20 working days), although an employee’s contract can provide for a higher amount.\nPart-time workers’ entitlement is calculated as 8.00% of the hours worked, subject to a maximum of four working weeks per leave year.\nIt is permitted to allow carryover of unused leave, terms and policies can vary according to each company’s set up and policies.",
          "public_holidays": "Public holidays that fall on the weekend are usually moved to a weekday as a day off in lieu.\nDate\tDay\tHoliday\tNotes\n1 Jan 2025\tWednesday\tNew Year’s Day\t\n3 Feb 2025\tMonday\tSt Brigid’s Day\t\n17 Mar 2025\tMonday\tSaint Patrick’s Day\t\n21 Apr 2025\tMonday\tEaster Monday\t\n5 May 2025\tMonday\tMay Day\t\n2 Jun 2025\tMonday\tJune Bank Holiday\t\n4 Aug 2025\tMonday\tAugust Bank Holiday\t\n27 Oct 2025\tMonday\tOctober Bank Holiday\t\n25 Dec 2025\tThursday\tChristmas Day\t\n26 Dec 2025\tFriday\tSt Stephen’s Day",
          "sick_days": "The law in Ireland  mandates the right for workers to receive 5 days of sick pay per year from the first day of sickness, providing a medical certificate is presented by the 4th day of sickness:\nSick days can be taken consecutively or non-consecutive days.\nSick pay is paid by the employer at 70% of normal pay, up to a maximum of €110 daily.\nTo be eligible for this benefit the worker must be employed for at least 13 weeks before they can claim statutory sick pay.\nCompanies can choose to offer more generous sick pay policy.\nThis new entitlement is part of a wider 4-year phased sick pay legislation as follows:\nFrom 2025 – 7 days sick pay entitlement was expected but is currently on pause.\nFrom 2026 – 10 days sick pay entitlement",
          "maternity_leave": "Mothers are entitled to take a total of 42 weeks maternity leave. This is broken down as 26 weeks (156 days) of ordinary maternity leave with some pay where eligible through PRSI (24 weeks for adoption), followed by the right to immediately take an extra 16 weeks of unpaid additional maternity leave.\nMothers must take at least two weeks before the expected birth and at least four weeks after.\nThe entitlement for paid leave during the first 26 weeks maternity is dependent on whether the worker has contributed enough to Social Insurance (PRSI), as employers are not obligated to pay the maternity period.\nEligibility for payment from the PRSI consists of one of the following options:\nAt least 39 weeks of PRSI paid in the 12 months before the first day of the maternity leave\nAt least 39 weeks of PRSI paid since first starting work and at least 39 weeks of PRSI paid or credited in the relevant tax year or the tax year immediately following the relevant tax year\nAt least 26 weeks of PRSI paid in the relevant tax year and at least 26 weeks PRSI paid in the tax year immediately before the relevant tax year\nThe weekly standard rate of maternity benefit is is 289.00 EUR.",
          "paternity_leave": "Fathers or the partner of the mother are entitled to 2 weeks of paid paternity leave (paid by the Social Protection department if the employee has paid enough PRSI contributions to qualify).  Leave can start any time within the first six months after birth, or placement in the case of an adoption.\nRelevant parents are the following:\nThe father of the child\nThe partner (spouse, civil partner, or cohabitant) of the mother of the child\nThe parent of a donor-conceived child\nThe employer is not required to pay the employee during paternity leave, but the employee may qualify for paternity benefit during this time if they have contributed sufficient PRSI contributions. The weekly standard rate of Paternity benefit is is 289.00 EUR.",
          "parent’s_leave": "Each parent is entitled to 9 weeks of Parent’s Leave during the first 2 years of a child’s life, including adoption.\nThis leave is paid by the authorities, providing the employee has sufficiently contributed to the PRSI. The benefit amounts to up to €289 per week.",
          "parental_leave": "Parents are entitled to up to 26 weeks of unpaid parental leave for each eligible child before 12 years old. To qualify for the leave, the employee must have been employed for at least one year and provided the employer with a written parental leave request at least six weeks before the required start date.\nAdoptive leave entitles one adoptive parent to up to 24 weeks’ unpaid leave from the date the child is placed in the employee’s care.",
          "medical_care_leave": "Parents who need time off work to deal with serious medical care for their child can take 5 days of unpaid leave in any 12 consecutive month period.",
          "other_leave": "Depending on the collective agreement/employment contract terms, an employee may be allowed additional leave types once approved between the employer and employee for the following:\nBereavement Leave: It is not required but is common practice for an employee to be given 3 days of paid leave in the event of the death of an immediate member of the family.\nJury Service Leave: Employers must provide their full-time, regularly employed employees with job-protected and unpaid leave for their duty as jurors or as a witness in a case or acting as a plaintiff or defendant in the courts. Employees must provide a copy of the jury summons to the employer as evidence of requirement. The court will provide a specific amount of payment, and the employer can choose to provide any additional payment."
        },
        "termination": {
          "termination_process": "During the probation period, both the employer and the employee can terminate the employment relationship without giving a specific reason. However, the provisions regulating special termination protection as well as the applicable notice period in the contract of employment and other general requirements must be considered.\nEmployers needs to have substantial grounds for dismissal of an employee after 52 weeks of continuous employment. To avoid an “unfair dismissal claim”, the Irish Unfair Dismissal Act 1977 states the following scenarios are considered to be fair grounds for dismissal:\nCertain reasons for dismissal are considered to be automatically unfair. These include, but are not limited to:\nMembership or proposed membership of a trade union or engaging in trade union activities, whether within permitted times during work or outside of working hours\nReligious or political opinions\nLegal proceedings against an employer where an employee is a party or a witness\nRace, colour, sexual orientation, age or membership of the Traveller community\nPregnancy, giving birth or breastfeeding or any matters connected with pregnancy or birth\nAvailing of rights under legislation such as maternity leave, adoptive leave, paternity leave, carer’s leave, parental or force majeure leave\nUnfair selection for redundancy\nIt is important to note that according to the employment equality legislation, dismissal based on any of the following  grounds for discrimination is prohibited: gender, civil status, family status, age, disability, religious belief, race, sexual orientation or membership of the Traveller community. If an employee feels they have been discriminated against on any of the aforementioned grounds but have not completed the required years’ service to be able to bring a claim under the unfair dismissals legislation, it could be possible to submit an unfair dismissals claim under employment equality legislation.\nGeneral Requirements In Ireland, the dismissed employee has the option to challenge the dismissal with the Workplace Relations Commission and, if necessary, with the Labour Court and claim continued employment, if they believe the dismissal to be unfair.\nIn any termination, the following general requirements are to be followed (additional specific actions could be required based on a case by case assessment):\nThe employer must give written notice of termination to the employee.\nThe written notice of termination must be signed by the employer. This can be digitally signed by the employer and can be sent to the employee per email.\nIf the employer and the employee have mutually agreed upon a longer contractual notice period, the longer contractual notice period will prevail.\nTermination based upon the above listed reasons will require adherence to set process and procedures, along with strong evidence to ensure the termination will hold up to scrutiny in the event the termination in challenged.  In some cases it is advisable to consider an mutual separation agreement; the current benchmark for payout is up to 6 months salary, but this will vary depending on the individual circumstances.",
          "notice_period": "In accordance with the contract terms, the notice period is dependent on the length of employment according to the below minimums:\nDuring Probation = no notice required\n13 weeks – 2 years service = 1 week notice\n2-5 years service = 2 weeks notice\n5-10 years service = 4 weeks notice\n10-15 years service = 6 weeks notice\n15+ years service = 8 weeks notice\nThere is no statutory entitlement to pay in lieu of notice (PILON), however, it can be included within the employment contract.\nThere is also no statutory entitlement to garden leave. However, it can be included in the employment contract.",
          "severance_pay": "Severance is payable only to redundant employees with 2 years’ service at the rate of 2 weeks’ pay per year of service plus an additional week’s pay. Pay is capped at EUR 600 per week. More generous terms are possible and quite common.",
          "probation_period": "The common probationary period to use is 3 months. Generally probation periods should not exceed 6 months except in exceptional cases."
        },
        "common_benefits": [
          "Wellness allowance ranging from 40 to 80 EUR per  month",
          "Health allowance approximately 200 EUR monthly",
          "Life insurance allowance monthly 50 to 100 EUR",
          "Private pension employer contribution of 5% to 10% of salary",
          "Additional Paid Annual Leave between 25 to 30 days per year."
        ],
        "visa": {
          "short_stay_visas": "All applicants for a short stay ‘C’ visa (whether for a single entry or multiple entries) must show that they have a sufficiently strong family, social or economic ties to a place of residence in a country other than Ireland to assure the visa officer assessing the application that the projected stay in Ireland will be temporary and in accordance with the duration and conditions of the permission granted by the immigration authorities on arrival in Ireland.\nTypes of stay include Business, Conference or event, Tourist, and Internship.\nThe maximum stay allowed under a short stay ‘C’ visa is 90 days.",
          "long_stay_visas": "Individuals wishing to travel to Ireland for more than three months, for example, to pursue a course of study, for work, or to settle permanently in Ireland with family members who are already residents in Ireland, can apply for a long stay ‘D’ visa for a single entry.\nIf they are granted a long stay ‘D’ visa and wish to remain in the country for longer than three months or beyond the period of leave given to them by an immigration officer at an Irish port of entry, they will be required to register and obtain a residence permit."
        },
        "vat": {
          "general": "Standard VAT Rate: 23.00% standard rate on most goods and services.\nReduced VAT Rate: 13.5% on items such as coal, heating oil, veterinary fees, building services and certain food products.\nSecond Reduced VAT Rate: 9% on specific items e.g. on heat pumps installed since January 2025.\nLivestock VAT Rate: 4.8%\nFlat-Rate VAT Compensation for Farmers: 5.1%"
        },
        "authority_payments": [
          {
            "authority_payment": "PAYE/PRSI/USC",
            "due_date": "14 of the following month",
            "method": "Wire"
          }
        ]
      }
    }
  ]
}