{
  "scraped_at": "2025-08-24T18:41:04.680Z",
  "summary": {
    "total": 1,
    "success": 1,
    "failed": 0
  },
  "results": [
    {
      "country": "Serbia",
      "url": "https://www.papayaglobal.com/countrypedia/country/serbia/",
      "scraped_at": "2025-08-24T18:41:04.671Z",
      "data": {
        "contribution": {
          "employer_contributions": [
            {
              "rate": "10.00%",
              "description": "Pension and Disability Insurance* (minimum monthly contribution basis is RSD 45,950 and the maximum monthly contributions basis is  RSD 656,425 )"
            },
            {
              "rate": "5.15%",
              "description": "Health Insurance"
            },
            {
              "rate": "Minimum not set",
              "description": "Meal allowance & holiday allowance"
            },
            {
              "rate": "15.15%+ Allowance",
              "description": "Total Employment Cost"
            }
          ],
          "employee_contributions": [
            {
              "rate": "14.00%",
              "description": "Pension and Disability Insurance"
            },
            {
              "rate": "5.15%",
              "description": "Health Insurance"
            },
            {
              "rate": "0.75%",
              "description": "Unemployment Insurance"
            },
            {
              "rate": "19.90%",
              "description": "Total Employee Cost"
            },
            {
              "rate": "Employee Income Tax",
              "description": ""
            },
            {
              "rate": "10.00%",
              "description": "Income above three average annual salaries (approximately 20,000 EUR)."
            },
            {
              "rate": "15.00%",
              "description": "Income above three average annual salaries (approximately 40,000 EUR)."
            }
          ],
          "income_tax": []
        },
        "minimum_wage": "Minimum wages in Serbia is set at 308 RSD per hour. Assuming a typical working time of 176 hours the monthly minimum wage is 73,725 RSD.",
        "payroll": {
          "payroll_cycle": "In Serbia, the payroll frequency is typically on a monthly basis. The employer must make salary payments at least once a month.",
          "13th_salary": "There is no legal requirement for 13-month payments. Employers may issue bonuses at their discretion."
        },
        "working_hours": {
          "general": "The working week in Serbia is typically 40 hours, eight hours per day, five days a week.",
          "overtime": "All work above the standard working hours per week is to be paid as overtime and is regulated by the employment contract/collective agreements. When an employee is requested to work overtime or on holidays, there are maximums in relation to the number of hours allowed. These maximums are eight hours per week, four hours per day.\nAll overtime hours in excess of 40 hours per week are paid at an overtime compensation rate; this rate is typically 126.00% of the employee’s average salary rate. Overtime hours performed on a public holiday are compensated at 110.00% of an employee’s standard rate."
        },
        "leave": {
          "annual_leave_(vacation)": "Employees are entitled to 20 days of annual paid leave following the completion of one year of service with an employer. If the employee has not yet worked for six months within an organization, the employee accrues annual leave at the rate of 1/12 per month. Unused days can be carried over until the end of June of the following year.",
          "public_holidays": "Holidays that fall on a weekend are moved to the next working day. Employees are entitled to paid leave during public holidays based on their average salary in the preceding 12 months.\nDate\tDay\tHoliday\tNotes\n1 Jan 2025\tWednesday\tNew Year’s Day\t\n2 Jan 2025\tThursday\tNew Year’s Holiday\t\n7 Jan 2025\tTuesday\tOrthodox Christmas\t\n15 Feb 2025\tSaturday\tSerbia National Day\t\n17 Feb 2025\tMonday\tSerbia National Day Holiday\t\n18 Apr 2025\tFriday\tGood Friday\t\n21 Apr 2025\tMonday\tEaster Monday\t\n1 May 2025\tThursday\tLabour Day\t\n2 May 2025\tFriday\tLabour Day Holiday\t\n11 Nov 2025\tMonday\tArmistice Day",
          "sick_days": "Employees are entitled to 30 days of paid sick leave compensated by the employer at 65% of the employee’s standard salary. If an employee has fallen ill due to a workplace injury or sickness, an employer must compensate for this leave at 100% of the employee’s wage. If the sick leave surpasses 30 days of sick leave, the state pays the additional leave, not the employer.\nEmployers must submit a medical certificate for the sickness within the first three days of sickness.",
          "maternity_leave": "Mothers receive maternity leave that equates to a total of 365 days. Following the birth of a third child, the duration extends to a total of 24 months of leave. Leave may begin at a maximum of 45 days and no less than 28 days before the expected due date. During maternity, the employee receives compensation for their average salary over the past 1 months (capped at a maximum of five times the national average wage), paid for by the Government Republic Fund of Health Insurance from the first day of maternity leave. If the employee returns to work before the end of maternity leave, an employer must provide her with a 90 minutes’ paid lactation break during the workday.\nIf a mother experiences a miscarriage or a stillbirth, they are entitled to take off 3 months of paid leave.",
          "paternity_leave": "The father or partner is entitled to 5 days of paternity leave after the child’s birth, paid at full salary by the Employer.",
          "parental_leave": "Under certain circumstances, the partner can take over the Maternity Leave entitlement from the mother.\nAdoptive parents are entitled to eight months of leave after the adoptive child is placed in their care until the child is five years old. Adoptive parents are entitled to leave when the adoptive child is less than three months old until the child is 11 months.",
          "other_leave": "Bereavement Leave – in the event of the death of a father, mother, spouse, or child, an employee is entitled to 5 days’ leave.\nWedding Leave – workers are entitled to 5 days of leave in the event of their wedding.\nBlood Donation Leave-  – workers are entitled to 2 days of leave when voluntarily donating blood."
        },
        "termination": {
          "termination_process": "The termination process varies according to the employment agreement and collective agreement in place and is based on the type of contract and reason for termination.\nEmployers must provide an explanation of the reasoning for the dismissal and must do so in writing at least eight days before the termination initiation. An employee must be allowed to respond to an employer’s termination notice. Failure to provide this opportunity may result in a court invalidating the dismissal.",
          "notice_period": "Employers must give an employee eight days notice before the dismissal (five days during probation). An employee terminating the employment contract must provide 15 days’ notice.\nIn the event of layoffs, a notice period of 30 days is required.",
          "severance_pay": "In Serbia, severance pay is only paid in the case of layoffs. The severance payment is equal to at least 1/3 of the monthly average salary for the last 3 months multiplied by the years service at the company.",
          "probation_period": "In Serbia, the probation periods may vary depending on the employment contract in place. However, the probation period can be no more than six months.\nDuring the probation period, either the employer or employee can terminate the employment contract with five days’ notice."
        },
        "visa": {
          "general_info": "There are several requirements for every type of Serbian visa, but the specifics vary from visa to visa. However, some of the general requirements include:\n\nValid passport and photos\nLetter of invitation from a Serbian-based company\nApplication forms\nApplication fees\nProof of medical insurance\nProof of funds\n\nYour prospective employee should liaise with the Serbian Ministry of Interior Affairs to supply any relevant documents and application forms to their local embassy/consulate to apply for a work visa. Serbia has a range of visas for foreigners and workers. However, foreign employees’ most frequently requested visas are the C visas, for stays of fewer than 90 days, and D visas, for more than 90 days.\nThe employer must complete work permit applications. First, the employer must correspond with the National Employment Service to demonstrate that no Serbians can fill the position in question. If no Serbians can be found, the employer can apply for a work permit. The most frequently requested work permit in Serbia is the Type D Work Permit, specifically for foreigners working in Serbia temporarily. It lasts for one year and can be renewed for an additional year. It usually takes three weeks to process."
        },
        "vat": {
          "general": "The standard rate of VAT in Serbia is 20.00%"
        }
      }
    }
  ]
}