{
  "scraped_at": "2025-08-24T17:49:01.084Z",
  "summary": {
    "total": 1,
    "success": 1,
    "failed": 0
  },
  "results": [
    {
      "country": "China",
      "url": "https://www.papayaglobal.com/countrypedia/country/china/",
      "scraped_at": "2025-08-24T17:49:01.074Z",
      "data": {
        "contribution": {
          "employer_contributions": [],
          "employee_contributions": [],
          "income_tax": []
        },
        "minimum_wage": "The National minimum wage in China differs per region; the most common minimums include 2,420 CNY per month in Beijing and 2,690 CNY per month in Shanghai.",
        "payroll": {
          "payroll_cycle": "The payroll cycle in China is generally monthly, and payments are made on the last working day.",
          "13th_salary": "In China, it is customary to pay a 13th-month or even 14th-month salary during the month of the Lunar New Year or Spring Holiday. This will be stipulated within the employment contract."
        },
        "working_hours": {
          "general": "Standard working hours within China are 8 hours per day, 40 hours per week, up to a maximum number of 45 working hours per week.",
          "overtime": "All work above the standard weekly working hours is paid as overtime and regulated by employment contract/collective agreements. In general, no more than one hour of overtime a day is permitted except in exceptional circumstances. Overtime can increase to 3 hours a day with a maximum for the month of 36 hours.\nOvertime is paid at 150.00% of the standard salary rate for weekday work, increasing to 200.00% for weekends and 300% salary on public holidays. This applies to all roles including management level."
        },
        "leave": {
          "annual_leave_(vacation)": "Paid leave in China is set in the employment contract and is dependent upon the years of employment. Paid leave is in addition to all public holidays.\nFor an employee within the first year of employment, there is no entitlement for paid annual leave. However, after completing the first year up to the tenth year, the employee is entitled to 5 days of paid leave. This increases to 10 days for employees within 10 to 20 years of service and a maximum of 15 days paid leave for employees who have completed 20 years’ service or more.",
          "public_holidays": "There are 13 yearly public holidays, however, some regions have additional holidays.\nWorking on public holidays is uncommon in China, but if an employee is required to work the overtime payment is generally paid at 300% of the hourly rate. The hourly rate is calculated by using the monthly salary rate for the employee divided by 174 (average number of working hours in a month).\nWorking on standard holidays is paid at 200%\nIn China, public holidays are sometimes moved to create an extended holiday period.\nDate\tDay\tHoliday\tNotes\n1 Jan 2025\tWednesday\tNew Year’s Day\t\n28 Jan 2025\tTuesday\tSpring Festival\t\n29 Jan 2025\tWednesday\tSpring Festival\t\n30 Jan 2025\tThursday\tSpring Festival\t\n31 Jan 2025\tFriday\tSpring Festival\t\n1 Feb 2025\tSaturday\tSpring Festival\tStandard Holiday\n2 Feb 2025\tSunday\tSpring Festival\tStandard Holiday\n3 Feb 2025\tMonday\tSpring Festival\tStandard Holiday\n4 Feb 2025\tTuesday\tSpring Festival\tStandard Holiday\n4 Apr 2025\tFriday\tTomb Sweeping Day\t\n1 May 2025\tThursday\tLabour Day\t\n2 May 2025\tFriday\tLabour Day\t\n3 May 2025\tSaturday\tLabour Day\t\n4 May 2025\tSunday\tLabour Day\tStandard Holiday\n5 May 2025\tMonday\tLabour Day\tStandard Holiday\n31 May 2025\tSaturday\tDragon Boat Festival\t\n1 Jun 2025\tSunday\tDragon Boat Festival\t\n2 Jun 2025\tMonday\tDragon Boat Festival\tStandard Holiday\n1 Oct 2025\tWednesday\tNational Day\t\n2 Oct 2025\tThursday\tNational Day\t\n3 Oct 2025\tFriday\tNational Day\t\n4 Oct 2025\tSaturday\tNational Day\t\n5 Oct 2025\tSunday\tNational Day\t\n6 Oct 2025\tMonday\tMid-Autumn Festival\t\n7 Oct 2025\tTuesday\tMid-Autumn Festival\tStandard Holiday\n8 Oct 2025\tWednesday\tMid-Autumn Festival\tStandard Holiday",
          "sick_days": "Sick pay in China is outlined in the employment contract and depends on the years of employment, the actual amount of sick leave, and the provision of a professional medical certificate. Some of the regulations regarding the calculation for sick pay are made at a local level, e.g., there are differences between Shanghai and Beijing. However, in general, the process is as follows:\nThe amount of paid sick leave entitlement is based on the number of years of service.\nLess than five years entitles the employee to 3 months of sick leave\n5 – 10 years’ service entitles the employee to between 6 to 9 months of sick leave (region-specific)\n10 – 15 years’ service entitles the employee to between 12 to 18 months of sick leave (region-specific)\n15 – 20 years’ service entitles the employee to 18 months, and more than 20 years of service entitles the employee to up to 24 months of sick leave\nThe entitlement for sick pay is also based on the number of years’ service; for sick leave of fewer than six months, the calculation is as follows:\nLess than two years of employment – 60.00% of the regular wages\n2-4 years of employment – 70.00% of the regular wages\n4-6 years of employment – 80.00% of the regular wages\n6-8 years of employment – 90.00% of the regular wages\n8+ years of employment – 100.00% of the regular wages\nThe entitlement for sick pay is also based on the number of years of service for sick leave of more than six months in length; the calculation is as follows:\nLess than 1 year of employment – 40.00% of the regular wages\n1-3 years of employment – 50.00% of the regular wages\n3+ years of employment – 60.00% of the regular wages\nFemale employees are entitled to basic Maternity leave of 98 days, which can be taken from 15 days prior to the expected date of childbirth. Each individual province also has entitlement to extended maternity leave, up to a total maternity leave period of:\nChongqing, Guangdong – 178 days\n Tianjin – 128 days\nHenan, Hainan – 190 days\nJiangxi, Hebei (for the third child), Zhejiang (for the third child) – 188 days\nGansu, Heilongjiang, Fujian – 180 days\nGuangxi – 148 days\nJiangsu – 128 days:\nOther regions (including Beijing) – 158 days\nThe calculation of the maternity payment is made by the Social Security Bureau (where the employee is registered) and is typically based on the average monthly salary across the year preceding the due date, or 3x the minimum wage, whichever is greater. However, calculation of basic and extended maternity leave can vary per province regulations.\nAdditional leave entitlement is also in place as follows:\nPrenatal examination includes doctor visits during the first 12 weeks.\nDifficult delivery – leave days of natural delivery + 15 days\nMultiple deliveries – leave days of natural delivery + 15 days + 15 days extra per baby\nPrenatal leave: After 7th month of pregnancy can avail 1-hour day break. May also avail 2.5 months prenatal leave upon employer approval.\nBreastfeeding leave: For a child less than a year old, female employees may have up to two feeding periods per day (30 minutes per baby). Travel time for the same period shall be counted as working time. Alternatively, after childbirth, female employees may also apply for leave of 6.5 months upon employer approval. With maternity insurance (a part of Social Security Insurance), the employee is compensated with an allowance rather than her normal salary during maternity leave.\nAbortion or Miscarriage within first 4 months – 15 days\nAbortion or Miscarriage after first 4 months – 42 days\nTermination of workers during pregnancy and within 1 year from Childbirth, is not permitted.\nPaternity Leave\nMale employees requesting paternity leave are, in the plurality of regions, entitled to 15 days. However, this may vary by location. The following are the cities that do not follow the 15-day norm:\nTianjin, Shandong – 7 days\nShanghai – 10 days\nLiaoning, Chongqing, Sichuan, Hunan – 20 days\nNingxia, Guangxi, Inner Mongolia – 25 days\nHe’nan, Jiangxi, Anhui, Yunnan, Gansu – 30 days:",
          "parental_leave": "Parents are entitled to paid Childcare leave, the length of which is determined by each individual province as follows:\nBeijing & Shanghai: 5 days’ childcare leave each year until their child reaches three years old.\nFujian, Guangxi, Inner Mongolia, Heilongjiang, Liaoning, Hebei, Jiangxi, Jiangsu, Sichuan, Guizhou, Zhejiang, Tianjin, Ningxia, Henan, Hubei, Hunan, Hainan, Xinjiang, Shandong, and Guangdong: 10 days leave each year for couples with children under the age of three years old.\nAnhui: 10 days leave per parent each year until their child is six years old.\nYunnan: 10 days leave per year can be taken by either parent who has children under the age of three years old. An additional 5 days of leave can be taken per year by parents who have more than two children under the age of three years old.\nShanxi, Qinghai & Gansu: 15 days leave each year to couples with children under the age of three years old.\nChongqing: Two options on how to use this leave (1) After the Maternity/Paternity leave expires either parent can take childcare leave until the child reaches one year old; or (2) both parents can take 5 to 10 days of leave each year until the child reaches six years old.",
          "other_leave": "In China, In the event of the death of an immediate family member, an employee is entitled to up to three days’ leave, depending on the employment contract and region.\nIn the event of an employee’s marriage, an employee is entitled to between three and ten days’ leave, depending on the employment contract and region."
        },
        "termination": {
          "termination_process": "There is no ‘at-will’ employment in China and terminations of employees must therefore be with a just cause.\nJustified reasons include: the worker does not satisfy the conditions for employment during the probation period; the worker materially breaches the Employer’s rules and regulations; the worker commits serious dereliction of duty or practices graft causing substantial damage to the company; the worker establishes an employment relationship with another Employer which materially affects the completion of his tasks; after a set period of medical care for illness or non-work-related injury which means the worker cannot engage in his original work or in another role; the worker is incompetent in his role even after training or adjustment of his position; or issues related to downsizing and bankruptcy.\nIt is also possible to terminate using a Mutual Termination Agreement. The will include a negotiated severance pay not less than the statutory minimum.\nWhen an Employer is to terminate an employment contract unilaterally, they shall give the Trade union (where applicable) advance notice with the reasoning.",
          "notice_period": "An Employer or Employee must give 30 days’ prior written notice. Employers do not need to give notice for misconduct cases or termination due to failure to meet the conditions of employment during the probation period. It is also possible for the Employer to pay in lieu of notice.\nDuring the probation period, an Employee may terminate his employment contract by giving 3 days’ prior notice.",
          "severance_pay": "Severance pay is based on the number of years an employee has worked with the employer at the rate of 1 month’s average wage for each year worked, rounded up to the nearest 0.5 or 1 years.\nIf the monthly wage of a Employee is greater than three times the average monthly wage of employees in the Employer’s area (as published by the People’s Government at the level of municipality directly under the central government or municipality divided into districts of the area 1 where the Employer is located), the rate of severance pay shall be three times the average monthly wage of employees capped at 12 years of work (calculated based on the average salary over the 12 months prior to termination) .",
          "probation_period": "The probation period for Indefinite Term contracts is up to a maximum 6 months.\nFor Fixed Term contracts, the probation period varies depending on the length of employment. Contracts with a length of:\n3 months to 1 year = a maximum of 1 month probation\n1 – 3 years = a maximum of 2 months probation\n3+ years = a maximum of 6 months probation\nAn Employer may stipulate only one probation period with any given Employee.\nIf an Employer terminates an employment contract during the probation period, they must explain the reasons to the Employee."
        },
        "visa": {
          "general_info": "The employer must sponsor the visa and must be an accredited company that may hire foreign employees. The employee must be a certified foreign expert in the field they will be working.\nIn China, there is an age limit for male and female applicants for a work visa; for male applicants, the age limit is 24-65, and for female employees, the age limit is 24-55. The employer must send a government-issued employment permit and visa notification letter to the employee, executed and submitted to the Chinese government.\nA Z Visa is valid for only 30 days upon arrival, and during this time, the employer must apply for a temporary residence permit on behalf of the employee. The Z visa is valid for 90 days up to 50 years.\nOther visa options include the R Visa for highly skilled people in great demand in China and the J Visa for journalists.\nThe process usually takes about 8 weeks to complete."
        },
        "vat": {
          "general": "The average standard rate of VAT in China is 13.00%."
        },
        "authority_payments": [
          {
            "authority_payment": "Tax office",
            "frequency": "Monthly, 15th of following month",
            "methods": "Bank transfer\nRMB"
          },
          {
            "authority_payment": "Social insurance office",
            "frequency": "Monthly, end of the month",
            "methods": "Bank transfer\nRMB"
          },
          {
            "authority_payment": "Housing fund office",
            "frequency": "Monthly, end of the month",
            "methods": "Bank transfer\nRMB"
          }
        ]
      }
    }
  ]
}