{
  "scraped_at": "2025-08-24T19:06:19.411Z",
  "summary": {
    "total": 1,
    "success": 1,
    "failed": 0
  },
  "results": [
    {
      "country": "South Africa",
      "url": "https://www.papayaglobal.com/countrypedia/country/south-africa/",
      "scraped_at": "2025-08-24T19:06:19.403Z",
      "data": {
        "contribution": {
          "employer_contributions": [],
          "employee_contributions": [],
          "income_tax": []
        },
        "minimum_wage": "The minimum wage in South Africa is 28.79 ZAR an hour.",
        "payroll": {
          "payroll_cycle": "In South Africa, there is no set payroll cycle. The payroll cycle is typically stipulated in the employment contract, which is to be agreed upon by the employee and employer. The payroll cycle can run monthly, weekly, or bi-weekly.",
          "13th_salary": "13th-month salary payments are customary in South Africa and should be paid in December of each year."
        },
        "working_hours": {
          "general": "The standard working week in South Africa can be no longer than 45 hours a week, 9 hours per day.",
          "overtime": "If work time limits are passed, overtime pay is compulsory. The maximum overtime hours are up to 10 hours per working week.\nOvertime is paid after working the maximum hours of 45 hours in one week and is paid at the statutory rate of 150.00% for employees who earn below the threshold of 205,433.30 ZAR annually on weekdays and 200.00% for overtime hours worked on a weekend.\nEmployees who earn over the threshold of 254,371.67 ZAR annually are not entitled to any overtime compensation. It is not possible in the employment contract to have a salary which already includes overtime pay."
        },
        "leave": {
          "annual_leave_(vacation)": "A full-time employee in South Africa is entitled to 21 consecutive days (15 working days) of paid annual leave; this is the minimum mandatory leave entitlement. The employee can accrue paid annual leave monthly at the rate of 1.25 days per month (1 day for every 17 days worked). Unused leave carries over into the next year.",
          "public_holidays": "When a public holiday falls on a Sunday, the following Monday shall be a public holiday in lieu.\nDate\tDay\tHoliday\tNotes\n1 Jan 2025\tWednesday\tNew Year’s Day\t\n21 Mar 2025\tFriday\tHuman Rights Day\t\n18 Apr 2025\tFriday\tGood Friday\t\n21 Apr 2025\tMonday\tFamily Day\t\n27 Apr 2025\tSunday\tFreedom Day\t\n28 Apr 2025\tMonday\tFreedom Day Holiday\tDay Off in Lieu\n1 May 2025\tThursday\tWorkers’ Day\t\n29 May 2025\tWednesday\tElection Day\t\n16 Jun 2025\tMonday\tYouth Day\t\n9 Aug 2025\tSaturday\tNational Women’s Day\t\n24 Sep 2025\tWednesday\tHeritage Day\t\n16 Dec 2025\tTuesday\tDay of Reconciliation\t\n25 Dec 2025\tThursday\tChristmas Day\t\n26 Dec 2025\tFriday\tDay of Goodwill",
          "sick_days": "Sick leave is paid at 100% pay of the employee’s regular salary rate and granted on a three-year cycle of 30 sick days for a 5 day working week and 36 sick days for a 6 days working week.\nDuring the first 6 months of employment, the employee accrues only 1 day of paid sick leave for every 26 days worked. From the seventh month of employment the full entitlement is granted to the employee. Any sick leave days that were taken during the first six months of employment will be deducted from the full 3 year cycle.\nAny days not used within the 3 years cycle will be lost and the days will reset under a new accrual cycle.\nIf the employee is absent for more than two consecutive days, they must produce a medical certificate.",
          "maternity_leave": "A pregnant employee is entitled to 4 months of unpaid maternity leave. The leave can be taken anytime from four weeks before the due date, and the employee must not return to work until six weeks after the delivery date. This is relevant for any job role unless the employee works less than 24 hours a month.\nIf the employee has been contributing to UIF, they would be eligible for a maternity benefit of up to a maximum of 60.00% of the regular salary rate, depending on the level of income/insurance coverage. These maternity benefit payments are made for a maximum of 121 days.\nThe Employee shall notify in writing of the date of commencement of maternity leave and the date of return to work after the maternity leave at least four weeks in advance.\nA recent judgment was issued by the High Court of South Africa on October 2023. The ruling stated that all parents, regardless of gender, should be entitled to four months of parental leave from their employers. This also applies to adoptive parents, specifically those adopting a child younger than two years. While this ruling is still under review, it has already been implemented by many employers.",
          "paternity_leave": "Fathers are entitled to leave through the Parental Leave policy.",
          "parental_leave": "New parents, including fathers, adopting parents, and surrogates, are entitled to Parental Leave of 10 consecutive calendar days, unpaid, when their children are born/given to the parent(s).\nThis entitlement only applies if the employee is not eligible for maternity leave, adoption leave or commissioning parental leave.\nAdoption Leave\nLeave of 10 consecutive weeks is in place for the adoption of a child below the age of 2. A single parent is entitled to 10 consecutive weeks’ adoption leave. If there are two adoptive parents, only one can benefit from this leave,  however, the other can use the regular Parental Leave.\nCommissioning Parental Leave\nThis leave is in place for the primary parent who will take care of the child when subject to being a commissioning parent in a surrogate motherhood agreement. The entitled length is at least 10 weeks consecutive leave. Where there are two commissioning parents, only one would be entitled to 10 consecutive weeks’ commissioning parental leave. The other parent is entitled to use the 10 consecutive calendar days’ regular Parental Leave.\nAll types of Parental Leaves are unpaid, however, employees can claim 66% of their earnings subject to the maximum income threshold from the Unemployment Insurance Fund (UIF). In order to qualify an employee must have at least 13 weeks continuous service.",
          "other_leave": "Study leave: The Labour law does not specify a study leave entitlement. Each employer can decide its own policy on if to provide study leave, and if it will be paid or unpaid.\nWork-related injury leave: If an employee is injured at work and takes more than 4 days of leave due to the injury, they are entitled to 75% of their regular pay for up to 3 months. After 3 months of leave, the employee must claim compensation from the compensation fund and receives 75% of their normal pay. In addition, for the first 3 months, the employer is able to request payment from the compensation fund.\nFamily Responsibility Leave: Workers with at least 4 months service may take up to 3 days of paid leave during each 12 monthly cycle. a year to attend to certain family responsibilities such as:\nBirth of their child\nChild sickness\nin the event of the death:\nOf their spouse or life partner\nParent or adoptive parent\nGrandparent\nChild or adopted child\nGrandchild\nSibling.\nEmployees must provide proof of the circumstances necessitating the absence in order to receive payment."
        },
        "termination": {
          "termination_process": "The termination process varies according to the employment agreement or collective agreement in place and is based on the type of contract and reason for termination.",
          "notice_period": "The notice period for employees can differ and is stipulated in the employment contract/collective bargaining agreement. If the notice period is not mentioned in the employment contract, the minimum required by law is dependent on the employee’s length of service as below:\n0 – 6 months of service: 1 weeks’ notice\n6 months – 1 year of service: 2 weeks’ notice\n1+ years service: 4 weeks’ notice\nIf a longer notice period was agreed in the employment contract, it must be honored.",
          "severance_pay": "Severance pay in South Africa is only payable in the event of a dismissal for operational requirements. In general, employees are entitled to one week’s severance pay for every year of completed service unless the employment contract has been terminated due to poor performance or misconduct; in this case, no severance payment is due.\nif the termination is procedurally unfair or reinstatement is not practical, the employee might be entitled to compensation equal to up to 12 months.",
          "probation_period": "Probation or trial periods are generally set within the employee’s employment contract; however, standard practice in South Africa is three months. It is possible to use a longer probation period provided the length is deemed reasonable given the circumstances of the job.\nThe duration of the probation period must be reasonable in regard to the period it is required to determine the employee’s suitability for the job. The common practice is a probation period of 3-6 months.\nAn employer cannot terminate the employment at the end of the probation period and will be required to follow a fair performance management process and provide the employee with reasonable guidance and training before termination their employment."
        },
        "visa": {
          "general_info": "Any foreigner who wishes to work in South Africa has several options of temporary work visas. These include general employment, inter-company transfer, highly skilled migrant, or business entrepreneur.\nAs South Africa has a growing economy and manufacturing sector, the country has many job opportunities for skilled workers in various positions, and foreigners are increasingly finding work in South Africa as detailed in reported critical skills lists. However, there are fewer opportunities for employment in South Africa in unskilled or semi-skilled positions.\nThere is also an emphasis on attracting entrepreneurs in South Africa, particularly where this will result in:\n\ncapital being brought into South Africa from abroad\nthe manufacture of goods for export\nthe employment of South Africans\n\nThe various types of South African work visas depend on the applicant’s employment/financial/skills position.\nTwo of the most commonly requested visas are:\n\nCritical Skills Work Visa: The South African Department of Home Affairs periodically publishes a list of critical skills in demand by the government. Applicants who possess these skills can apply for a Critical Skills Work Visa. It is not necessary to secure employment before the visa, but the applicant must prove that they possess the essential skills. The duration of the visa is five years, though it is possible to apply for permanent residency in South Africa under some conditions.\nCorporate Visa: A Corporate Visa is granted to a corporate entity, allowing the company to hire a pre-determined number of foreign workers for three years."
        },
        "vat": {
          "general": "The standard rate of VAT in South Africa is 15.00%."
        }
      }
    }
  ]
}